Revit 2026 API

# KeynoteEntryKeynoteText Property

---

The text associated with this KeynoteEntry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string KeynoteText { get; }
```
```vb
Public ReadOnly Property KeynoteText As String
	Get
```
```cpp
public:
property String^ KeynoteText {
	String^ get ();
}
```
```fsharp
member KeynoteText : string with get
```

#### Property Value

String

This value does not have to be set; if not set, the property returns an empty string.

#### Reference

KeynoteEntry Class

Autodesk.Revit.DB Namespace